#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>
```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/tnorlund/gh-actions-demo/runs/run-Hrc2CC1ZZyx3127w

Waiting for the plan to start...

Terraform v0.14.7
Configuring remote state backend...
Initializing Terraform configuration...
module.node_layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:us-east-1:681647709217:layer:analytics_js:2]
module.python_layer.aws_lambda_layer_version.layer: Refreshing state... [id=arn:aws:lambda:us-east-1:681647709217:layer:analytics_python:2]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # module.analytics.data.aws_iam_policy_document.kinesis will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "kinesis"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*",
              + (known after apply),
            ]
          + sid       = "lambdaKinesisProcessor"
        }
    }

  # module.analytics.data.aws_iam_policy_document.kinesis_policy will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "kinesis_policy"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:GetFunctionConfiguration",
              + "lambda:InvokeFunction",
              + "s3:AbortMultipartUpload",
              + "s3:GetBucketLocation",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:ListBucketMultipartUploads",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "kinesisId"
        }
    }

  # module.analytics.data.aws_iam_policy_document.lambda_policy_doc will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda_policy_doc"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:DeleteItem",
              + "dynamodb:DescribeStream",
              + "dynamodb:GetRecords",
              + "dynamodb:GetShardIterator",
              + "dynamodb:ListShards",
              + "dynamodb:ListStreams",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*",
              + (known after apply),
              + (known after apply),
            ]
          + sid       = "codecommitid"
        }
    }

  # module.analytics.data.aws_iam_policy_document.s3 will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "s3"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "dynamodb:BatchWriteItem",
              + "dynamodb:DeleteItem",
              + "dynamodb:PutItem",
              + "dynamodb:Query",
              + "dynamodb:Scan",
              + "dynamodb:UpdateItem",
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
              + "s3:GetObject",
              + "s3:ListBucket",
              + "s3:PutObject",
            ]
          + effect    = "Allow"
          + resources = [
              + "arn:aws:logs:*",
              + "arn:aws:s3:::*/*",
              + (known after apply),
            ]
          + sid       = "lambdaS3Processor"
        }
    }

  # module.analytics.aws_cloudwatch_log_group.processor will be created
  + resource "aws_cloudwatch_log_group" "processor" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/firehose-lambda-processor"
      + retention_in_days = 14
    }

  # module.analytics.aws_cloudwatch_log_group.stream will be created
  + resource "aws_cloudwatch_log_group" "stream" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + name              = "/aws/lambda/tylernorlund_blog_analytics"
      + retention_in_days = 14
    }

  # module.analytics.aws_dynamodb_table.table will be created
  + resource "aws_dynamodb_table" "table" {
      + arn              = (known after apply)
      + billing_mode     = "PROVISIONED"
      + hash_key         = "PK"
      + id               = (known after apply)
      + name             = "Blog"
      + range_key        = "SK"
      + read_capacity    = 5
      + stream_arn       = (known after apply)
      + stream_enabled   = true
      + stream_label     = (known after apply)
      + stream_view_type = "NEW_IMAGE"
      + tags             = {
          + "Developer" = "Tyler Norlund"
          + "Project"   = "Blog"
        }
      + write_capacity   = 5

      + attribute {
          + name = "GSI1PK"
          + type = "S"
        }
      + attribute {
          + name = "GSI1SK"
          + type = "S"
        }
      + attribute {
          + name = "GSI2PK"
          + type = "S"
        }
      + attribute {
          + name = "GSI2SK"
          + type = "S"
        }
      + attribute {
          + name = "PK"
          + type = "S"
        }
      + attribute {
          + name = "SK"
          + type = "S"
        }

      + global_secondary_index {
          + hash_key           = "GSI1PK"
          + name               = "GSI1"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "GSI1SK"
          + read_capacity      = 5
          + write_capacity     = 5
        }
      + global_secondary_index {
          + hash_key           = "GSI2PK"
          + name               = "GSI2"
          + non_key_attributes = []
          + projection_type    = "ALL"
          + range_key          = "GSI2SK"
          + read_capacity      = 5
          + write_capacity     = 5
        }

      + point_in_time_recovery {
          + enabled = true
        }

      + server_side_encryption {
          + enabled     = (known after apply)
          + kms_key_arn = (known after apply)
        }
    }

  # module.analytics.aws_iam_role.kinesis will be created
  + resource "aws_iam_role" "kinesis" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "kinesis_process_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.analytics.aws_iam_role.kinesis_role will be created
  + resource "aws_iam_role" "kinesis_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "firehose.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "kinesis_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.analytics.aws_iam_role.lambda_role will be created
  + resource "aws_iam_role" "lambda_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "iam_dynamo_stream"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.analytics.aws_iam_role.s3 will be created
  + resource "aws_iam_role" "s3" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + max_session_duration  = 3600
      + name                  = "s3_process_role"
      + path                  = "/"
      + unique_id             = (known after apply)
    }

  # module.analytics.aws_iam_role_policy.kinesis_stream will be created
  + resource "aws_iam_role_policy" "kinesis_stream" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.analytics.aws_iam_role_policy.lambda_policy will be created
  + resource "aws_iam_role_policy" "lambda_policy" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.analytics.aws_iam_role_policy.lambda_processor will be created
  + resource "aws_iam_role_policy" "lambda_processor" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.analytics.aws_iam_role_policy.s3 will be created
  + resource "aws_iam_role_policy" "s3" {
      + id     = (known after apply)
      + name   = (known after apply)
      + policy = (known after apply)
      + role   = (known after apply)
    }

  # module.analytics.aws_kinesis_firehose_delivery_stream.extended_s3_stream will be created
  + resource "aws_kinesis_firehose_delivery_stream" "extended_s3_stream" {
      + arn            = (known after apply)
      + destination    = "extended_s3"
      + destination_id = (known after apply)
      + id             = (known after apply)
      + name           = "tylernorlund_blog_analytics"
      + version_id     = (known after apply)

      + extended_s3_configuration {
          + bucket_arn         = (known after apply)
          + buffer_interval    = 60
          + buffer_size        = 1
          + compression_format = "UNCOMPRESSED"
          + role_arn           = (known after apply)
          + s3_backup_mode     = "Disabled"

          + cloudwatch_logging_options {
              + enabled         = true
              + log_group_name  = "/aws/lambda/tylernorlund_blog_analytics"
              + log_stream_name = "example_stream"
            }

          + processing_configuration {
              + enabled = true

              + processors {
                  + type = "Lambda"

                  + parameters {
                      + parameter_name  = "LambdaArn"
                      + parameter_value = (known after apply)
                    }
                }
            }
        }
    }

  # module.analytics.aws_lambda_event_source_mapping.dynamo_mapping will be created
  + resource "aws_lambda_event_source_mapping" "dynamo_mapping" {
      + batch_size                    = 100
      + enabled                       = true
      + event_source_arn              = (known after apply)
      + function_arn                  = (known after apply)
      + function_name                 = (known after apply)
      + id                            = (known after apply)
      + last_modified                 = (known after apply)
      + last_processing_result        = (known after apply)
      + maximum_record_age_in_seconds = (known after apply)
      + maximum_retry_attempts        = (known after apply)
      + parallelization_factor        = (known after apply)
      + starting_position             = "TRIM_HORIZON"
      + state                         = (known after apply)
      + state_transition_reason       = (known after apply)
      + uuid                          = (known after apply)
    }

  # module.analytics.aws_lambda_function.dynamo_db_stream will be created
  + resource "aws_lambda_function" "dynamo_db_stream" {
      + arn                            = (known after apply)
      + function_name                  = "dynamodb-lambda-stream"
      + handler                        = "dynamo_processor.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:681647709217:layer:analytics_js:2",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = "tf-cloud"
      + s3_key                         = "dynamo_processor.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Developer" = "Tyler Norlund"
          + "Project"   = "Blog"
        }
      + timeout                        = 3
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IPIFY_KEY"  = (sensitive)
              + "TABLE_NAME" = "Blog"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.analytics.aws_lambda_function.kinesis_processor will be created
  + resource "aws_lambda_function" "kinesis_processor" {
      + arn                            = (known after apply)
      + function_name                  = "firehose-lambda-processor"
      + handler                        = "kinesis_processor.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:681647709217:layer:analytics_js:2",
        ]
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "nodejs12.x"
      + s3_bucket                      = "tf-cloud"
      + s3_key                         = "kinesis_processor.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Developer" = "Tyler Norlund"
          + "Project"   = "Blog"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IPIFY_KEY"  = (sensitive)
              + "TABLE_NAME" = "Blog"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.analytics.aws_lambda_function.s3 will be created
  + resource "aws_lambda_function" "s3" {
      + arn                            = (known after apply)
      + function_name                  = "s3-lambda-processor"
      + handler                        = "s3_processor.s3_processor"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:681647709217:layer:analytics_python:2",
        ]
      + memory_size                    = 256
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.8"
      + s3_bucket                      = "tf-cloud"
      + s3_key                         = "s3_processor.zip"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Developer" = "Tyler Norlund"
          + "Project"   = "Blog"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "IPIFY_KEY"  = (sensitive)
              + "TABLE_NAME" = "Blog"
            }
        }

      + tracing_config {
          + mode = (known after apply)
        }
    }

  # module.analytics.aws_lambda_permission.blog will be created
  + resource "aws_lambda_permission" "blog" {
      + action        = "lambda:InvokeFunction"
      + function_name = "firehose-lambda-processor"
      + id            = (known after apply)
      + principal     = "firehose.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

  # module.analytics.aws_lambda_permission.s3 will be created
  + resource "aws_lambda_permission" "s3" {
      + action        = "lambda:InvokeFunction"
      + function_name = "s3-lambda-processor"
      + id            = (known after apply)
      + principal     = "s3.amazonaws.com"
      + source_arn    = (known after apply)
      + statement_id  = (known after apply)
    }

  # module.analytics.aws_s3_bucket.bucket will be created
  + resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = "private"
      + arn                         = (known after apply)
      + bucket                      = "blog-analytics"
      + bucket_domain_name          = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Developer" = "Tyler Norlund"
          + "Project"   = "Blog"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + versioning {
          + enabled    = (known after apply)
          + mfa_delete = (known after apply)
        }
    }

  # module.analytics.aws_s3_bucket_notification.bucket_terraform_notification will be created
  + resource "aws_s3_bucket_notification" "bucket_terraform_notification" {
      + bucket = (known after apply)
      + id     = (known after apply)

      + lambda_function {
          + events              = [
              + "s3:ObjectCreated:Put",
            ]
          + id                  = (known after apply)
          + lambda_function_arn = (known after apply)
        }
    }

Plan: 20 to add, 0 to change, 0 to destroy.
```
</details>
*Pusher: @tnorlund, Action: `pull_request`*